"Numbers" = "Numbers";"References" = "References";"SingleComment" = "-- Comment";"Control Statements" = "Control Statements";"Constants" = "Constants";"Comment" = "(* Comment *)";"Predefined Variables" = "Predefined Variables";"Operators" = "Operators";"Characters" = "Characters";"Variable Assigments" = "Variable Assigments";"Base" = "Base";"Commands" = "Commands";"String" = "\"Strings\"";